# Pandas教程

### 2017七月在线 机器学习线上集训 julyedu.com
by 褚则伟 

## 关于Merge, Join和Concatenate

## 目录
- Merge
- Join
- Concatenate


## merge
### 七月在线 julyedu.com

In [1]:
import pandas as pd
import numpy as np

In [62]:
df1 = pd.DataFrame({'apts': [55000, 60000],
                   'cars': [200000, 300000],},
                  index = ['Shanghai', 'Beijing'])
print(df1)

           apts    cars
Shanghai  55000  200000
Beijing   60000  300000

In [63]:
df2 = pd.DataFrame({'apts': [25000, 20000],
                   'cars': [150000, 120000],},
                  index = ['Hangzhou', 'Najing'])
print(df2)

           apts    cars
Hangzhou  25000  150000
Najing    20000  120000

In [5]:
df3 = pd.DataFrame({'apts': [30000, 10000],
                   'cars': [180000, 100000],},
                  index = ['Guangzhou', 'Chongqing'])
print(df3)

            apts    cars
Guangzhou  30000  180000
Chongqing  10000  100000

### concatenate

In [64]:
result = pd.concat([df1, df2, df3])
print(result)

            apts    cars
Shanghai   55000  200000
Beijing    60000  300000
Hangzhou   25000  150000
Najing     20000  120000
Guangzhou  30000  180000
Chongqing  10000  100000

在concatenate的时候可以指定keys，这样可以给每一个部分加上一个Key。

以下的例子就构造了一个hierarchical index。

In [13]:
result2 = pd.concat([df1, df2, df3], keys=['x', 'y', 'z'])
print(result2)

              apts    cars
x Shanghai   55000  200000
  Beijing    60000  300000
y Hangzhou   25000  150000
  Najing     20000  120000
z Guangzhou  30000  180000
  Chongqing  10000  100000

In [14]:
result2.loc["y"]

           apts    cars
Hangzhou  25000  150000
Najing    20000  120000

如果要换个方向concat，只要声明axis就可以了

In [16]:
df4 = pd.DataFrame({'salaries': [10000, 30000, 30000, 20000, 15000]},
                  index = ['Suzhou', 'Beijing', 'Shanghai', 'Guangzhou', 'Tianjin'])
print(df4)

           salaries
Suzhou        10000
Beijing       30000
Shanghai      30000
Guangzhou     20000
Tianjin       15000

In [19]:
result3 = pd.concat([result, df4], axis=1)
print(result3)

              apts      cars  salaries
Beijing    60000.0  300000.0   30000.0
Chongqing  10000.0  100000.0       NaN
Guangzhou  30000.0  180000.0   20000.0
Hangzhou   25000.0  150000.0       NaN
Najing     20000.0  120000.0       NaN
Shanghai   55000.0  200000.0   30000.0
Suzhou         NaN       NaN   10000.0
Tianjin        NaN       NaN   15000.0

用inner可以去掉NaN,也就是说如果出现了不匹配的行就会被忽略

In [21]:
result4 = pd.concat([result, df4], axis=1, join='inner')
print(result3)

            apts    cars  salaries
Shanghai   55000  200000     30000
Beijing    60000  300000     30000
Guangzhou  30000  180000     20000

如果我们只想保留左边部分的index呢

In [22]:
result5 = pd.concat([result, df4], axis=1, join_axes=[result.index])
print(result5)

            apts    cars  salaries
Shanghai   55000  200000   30000.0
Beijing    60000  300000   30000.0
Hangzhou   25000  150000       NaN
Najing     20000  120000       NaN
Guangzhou  30000  180000   20000.0
Chongqing  10000  100000       NaN

右边部分

In [23]:
result6 = pd.concat([result, df4], axis=1, join_axes=[df4.index])
print(result6)

              apts      cars  salaries
Suzhou         NaN       NaN     10000
Beijing    60000.0  300000.0     30000
Shanghai   55000.0  200000.0     30000
Guangzhou  30000.0  180000.0     20000
Tianjin        NaN       NaN     15000

#### 用[```append```](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.append.html)来做concatenation

In [24]:
print(df1.append(df2))

           apts    cars
Shanghai  55000  200000
Beijing   60000  300000
Hangzhou  25000  150000
Najing    20000  120000

In [25]:
print(df1.append(df4))

              apts      cars  salaries
Shanghai   55000.0  200000.0       NaN
Beijing    60000.0  300000.0       NaN
Suzhou         NaN       NaN   10000.0
Beijing        NaN       NaN   30000.0
Shanghai       NaN       NaN   30000.0
Guangzhou      NaN       NaN   20000.0
Tianjin        NaN       NaN   15000.0

In [28]:
df1.append([df2,df3])

            apts    cars
Shanghai   55000  200000
Beijing    60000  300000
Hangzhou   25000  150000
Najing     20000  120000
Guangzhou  30000  180000
Chongqing  10000  100000

Series和DataFrame还可以被一起concatenate，这时候Series会先被转成DataFrame然后做Join，因为Series本来就是一个只有一维的DataFrame对吧。

In [34]:
s1 = pd.Series([60, 50], index=['Shanghai', 'Beijing'], name='meal')
print(s1)

Shanghai    60
Beijing     50
Name: meal, dtype: int64

In [35]:
print(df1)

           apts    cars
Shanghai  55000  200000
Beijing   60000  300000

In [36]:
print(pd.concat([df1, s1], axis=1))

           apts    cars  meal
Shanghai  55000  200000    60
Beijing   60000  300000    50

下面讲如何append一个row到DataFrame里。

In [37]:
s2 = pd.Series([18000, 12000], index=['apts', 'cars'], name='Xiamen') #注意这里的name是必须要有的，因为要用作Index。
print(s2)

apts    18000
cars    12000
Name: Xiamen, dtype: int64

In [38]:
print(df1.append(s2))

           apts    cars
Shanghai  55000  200000
Beijing   60000  300000
Xiamen    18000   12000

### Merge(Join)
### 2017七月在线 机器学习线上集训 julyedu.com

In [65]:
result = result.reset_index().rename(columns={"index":"cities"})
result

      cities   apts    cars
0   Shanghai  55000  200000
1    Beijing  60000  300000
2   Hangzhou  25000  150000
3     Najing  20000  120000
4  Guangzhou  30000  180000
5  Chongqing  10000  100000

In [66]:
df4

   index     cities  salaries
0      0     Suzhou     10000
1      1    Beijing     30000
2      2   Shanghai     30000
3      3  Guangzhou     20000
4      4    Tianjin     15000

In [67]:
df = pd.merge(result, df4, on="cities")
print(df)

      cities   apts    cars  index  salaries
0   Shanghai  55000  200000      2     30000
1    Beijing  60000  300000      1     30000
2  Guangzhou  30000  180000      3     20000

In [68]:
df = pd.merge(result, df4, on='cities', how='outer')
print(df)

      cities     apts      cars  index  salaries
0   Shanghai  55000.0  200000.0    2.0   30000.0
1    Beijing  60000.0  300000.0    1.0   30000.0
2   Hangzhou  25000.0  150000.0    NaN       NaN
3     Najing  20000.0  120000.0    NaN       NaN
4  Guangzhou  30000.0  180000.0    3.0   20000.0
5  Chongqing  10000.0  100000.0    NaN       NaN
6     Suzhou      NaN       NaN    0.0   10000.0
7    Tianjin      NaN       NaN    4.0   15000.0

In [70]:
df = pd.merge(result, df4, on='cities', how='right')
print(df)

      cities     apts      cars  index  salaries
0   Shanghai  55000.0  200000.0      2     30000
1    Beijing  60000.0  300000.0      1     30000
2  Guangzhou  30000.0  180000.0      3     20000
3     Suzhou      NaN       NaN      0     10000
4    Tianjin      NaN       NaN      4     15000

In [72]:
df = pd.merge(result, df4, on='cities', how='left')
print(df)

      cities   apts    cars  index  salaries
0   Shanghai  55000  200000    2.0   30000.0
1    Beijing  60000  300000    1.0   30000.0
2   Hangzhou  25000  150000    NaN       NaN
3     Najing  20000  120000    NaN       NaN
4  Guangzhou  30000  180000    3.0   20000.0
5  Chongqing  10000  100000    NaN       NaN

In [75]:
df4 = df4.set_index("index")

In [76]:
df4

          cities  salaries
index
0         Suzhou     10000
1        Beijing     30000
2       Shanghai     30000
3      Guangzhou     20000
4        Tianjin     15000

#### join on index

In [78]:
df1

           apts    cars
Shanghai  55000  200000
Beijing   60000  300000
Shenzhen  58000  250000

In [80]:
df4 = df4.set_index("cities")

In [81]:
df4

           salaries
cities
Suzhou        10000
Beijing       30000
Shanghai      30000
Guangzhou     20000
Tianjin       15000

In [82]:
print(df1.join(df4))

           apts    cars  salaries
Shanghai  55000  200000   30000.0
Beijing   60000  300000   30000.0
Shenzhen  58000  250000       NaN

In [83]:
print(df1.join(df4, how='outer'))

              apts      cars  salaries
Beijing    60000.0  300000.0   30000.0
Guangzhou      NaN       NaN   20000.0
Shanghai   55000.0  200000.0   30000.0
Shenzhen   58000.0  250000.0       NaN
Suzhou         NaN       NaN   10000.0
Tianjin        NaN       NaN   15000.0

也可以用merge来写

In [84]:
print(pd.merge(df1, df4, left_index=True, right_index=True, how='outer'))

              apts      cars  salaries
Beijing    60000.0  300000.0   30000.0
Guangzhou      NaN       NaN   20000.0
Shanghai   55000.0  200000.0   30000.0
Shenzhen   58000.0  250000.0       NaN
Suzhou         NaN       NaN   10000.0
Tianjin        NaN       NaN   15000.0